{"modelTopology":{"class_name":"Model","config":{"name":"seq2seqModel","layers":[{"name":"embeddingInput","class_name":"InputLayer","config":{"batch_input_shape":[null,null,6],"dtype":"float32","sparse":false,"name":"embeddingInput"},"inbound_nodes":[]},{"name":"decoderInputs","class_name":"InputLayer","config":{"batch_input_shape":[null,null,41],"dtype":"float32","sparse":false,"name":"decoderInputs"},"inbound_nodes":[]},{"name":"encoderLstm","class_name":"LSTM","config":{"name":"encoderLstm","trainable":true,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":true,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["embeddingInput",0,0,{}]]]},{"name":"decoderLstm","class_name":"LSTM","config":{"name":"decoderLstm","trainable":true,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":true,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["decoderInputs",0,0,{}],["encoderLstm",0,1,{}],["encoderLstm",0,2,{}]]]},{"name":"decoderDense","class_name":"Dense","config":{"units":41,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"decoderDense","trainable":true},"inbound_nodes":[[["decoderLstm",0,0,{}]]]}],"input_layers":[["embeddingInput",0,0],["decoderInputs",0,0]],"output_layers":[["decoderDense",0,0]]},"keras_version":"tfjs-layers 4.17.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"encoderLstm/kernel","shape":[6,128],"dtype":"float32"},{"name":"encoderLstm/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"encoderLstm/bias","shape":[128],"dtype":"float32"},{"name":"decoderLstm/kernel","shape":[41,128],"dtype":"float32"},{"name":"decoderLstm/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"decoderLstm/bias","shape":[128],"dtype":"float32"},{"name":"decoderDense/kernel","shape":[32,41],"dtype":"float32"},{"name":"decoderDense/bias","shape":[41],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.17.0","convertedBy":null}